app/views/reservations/index.html.erb

SELECT 1 AS one FROM "reservations" WHERE "reservations"."user_id" = $1 LIMIT $2  [["user_id", 2], ["LIMIT", 1]]
SELECT "reservations".* FROM "reservations" WHERE "reservations"."user_id" = $1  [["user_id", 2]]
---
    <h1>My reservations</h1>
    <% if current_user.reservations.empty? %>

SELECT "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]
---
        <% current_user.reservations.each do |reservation| %>
        <% city = City.find(reservation.post.city_id) %>