app/views/posts/_form.html.erb

SELECT "countries".* FROM "countries"
---
  <%= form.label :country_id %>
  <%= select_tag :country, options_for_select(Country.all.map{ |co| [co.name, co.id] }, params[:country]), prompt: 'Select Country', class: 'form-control', id: "country" %>

SELECT "categories".* FROM "categories"
---
    <%= form.label :category_id %>
    <%= form.select :category_id, Category.all.map { |c| [c.name, c.id] }, {}, class: "form-control" %>