app/views/posts/_form.html.erb

    <%= form.label :category_id %>
    <%= form.select :category_id, Category.all.map { |c| [c.name, c.id] }, {}, class: "form-control" %>
---
SELECT "categories".* FROM "categories"