app/views/posts/_post.html.erb

<div id="<%= dom_id post %>">
<% city = City.find(post.city_id) %>
<% country = Country.find(city.country_id) %>
<% category = Category.find(post.category_id) %>
---
SELECT "cities".* FROM "cities" WHERE "cities"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "countries".* FROM "countries" WHERE "countries"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "categories".* FROM "categories" WHERE "categories"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]