app/views/posts/index.html.erb

SELECT "categories".* FROM "categories"
---
                                   <div>
                                        <%= select_tag :category, options_for_select(Category.all.map{ |c| [c.name, c.id] }, params[:category]), prompt: 'Select Category', class: 'custom-select' %>

SELECT "countries".* FROM "countries"
---
                                        <div>
                                            <%= select_tag :country, options_for_select(Country.all.map{ |co| [co.name, co.id] }, params[:country]), prompt: 'Select Country', class: 'custom-select', id: "country", remote: true %>