app/controllers/cities_controller.rb

SELECT "cities".* FROM "cities" WHERE "cities"."country_id" = $1  [["country_id", 2]]
---
    def index
      cities = City.where(country_id: params[:country_id])