app/controllers/comments_controller.rb

    def create
        @post = Post.find(params[:post_id])
        @comment = @post.comments.build(comment_params)
        @comment.user = current_user
        respond_to do |format|
          if @comment.save
---
SELECT "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
INSERT INTO "comments" ("body", "user_id", "post_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["body", "kajeto"], ["user_id", 4], ["post_id", 3], ["created_at", "2023-02-07 07:55:36.037425"], ["updated_at", "2023-02-07 07:55:36.037425"]]