app/controllers/posts_controller.rb

SELECT "categories".* FROM "categories"
SELECT "cities".* FROM "cities"
---
  def index
    @posts = Post.published
    if params[:category].present?
    @posts = @posts.where(category_id: params[:category])
    end
    if params[:city].present?

SELECT "users".* FROM "users" WHERE "users"."id" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["id", 3], ["LIMIT", 1]]
UPDATE "posts" SET "updated_at" = $1 WHERE "posts"."id" = $2  [["updated_at", "2023-02-07 07:55:15.338195"], ["id", 3]]
INSERT INTO "posts" ("created_at", "updated_at") VALUES ($1, $2) RETURNING "id"  [["created_at", "2022-11-10 07:28:47.287567"], ["updated_at", "2022-11-10 07:28:47.287567"]]
---
  def create_reservation
    @reservation = @reservation.new(reservation_params)
    @reservation.user = current_user
    @reservation.post = Post.find(params[:post_id])
    @reservation.save

SELECT "posts".* FROM "posts"
---
  def admin
    @posts = Post.all

INSERT INTO "posts" ("title", "body", "created_at", "updated_at", "user_id", "published_at", "category_id", "adress", "city_id", "price") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10) RETURNING "id"
---
  def create
    @post = Post.new(post_params)
    @post.published_at = DateTime.now if @post.published_at.blank?
    @post.user = current_user



    respond_to do |format|
      if @post.save

DELETE FROM "comments" WHERE "comments"."id" = $1  [["id", 1]]
---
    def destroy_children
      @post.comments.destroy_all