app/controllers/reservations_controller.rb

SELECT "reservations".* FROM "reservations" WHERE "reservations"."user_id" = $1 LIMIT $2  [["user_id", 2], ["LIMIT", 1]]
---
    def index
        @reservations = Reservation.find_by(user_id: current_user.id)

SELECT "users".* FROM "users" WHERE "users"."id" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
    def create
        @reservation = @reservation.new(reservation_params)
        @reservation.user = current_user
        @reservation.post = Post.find(params[:post_id])