app/models/user.rb

  def self.from_google(u)
    create_with(uid: u[:uid], name: u[:name], provider: 'google',
                password: Devise.friendly_token[0, 20]).find_or_create_by!(email: u[:email])
---
INSERT INTO "users" ("email", "encrypted_password", "reset_password_token", "reset_password_sent_at", "remember_created_at", "created_at", "updated_at", "name", "provider", "uid", "admin") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11) RETURNING "id"
SELECT "users".* FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "pirnat.aneja@gmail.com"], ["LIMIT", 1]]